Tekla.Structures.Drawing.GADrawing
The GADrawing class is for handling general arrangement drawings in Tekla Structures.
Creates an empty GA drawing based on standard attributes and opens it:
using Tekla.Structures.Drawing;
public class Example
{
public void Example1()
{
DrawingHandler drawingHandler = new DrawingHandler();
Drawing gaDrawing = new GADrawing();
gaDrawing.Insert();
drawingHandler.SetActiveDrawing(gaDrawing);
}
}
The following example shows how to insert an A3-sized GA drawing:
using Tekla.Structures.Drawing;
public class Example
{
public void Example1()
{
Size A3 = new Size(410.0, 287.0);
Drawing newDrawing = new GADrawing("standard", A3);
newDrawing.Insert();
}
}

Tekla.Structures.Drawing.GADrawing.#ctor
Instantiates a new GA drawing using standard attributes.

Tekla.Structures.Drawing.GADrawing.#ctor(System.Boolean)
Instantiates new GADrawing.
LoadAttributefile: used internally for selection for performance reasons

Tekla.Structures.Drawing.GADrawing.#ctor(System.String,System.String)
Instantiates a new GA drawing with the given name and attribute file.
Name: The name of the GA drawing.
AttributeFile: The name of the attribute file.

Tekla.Structures.Drawing.GADrawing.#ctor(System.String)
Instantiates a new GA drawing with the given attributes.
AttributeFile: The name of the attribute file.

Tekla.Structures.Drawing.GADrawing.#ctor(System.String,Tekla.Structures.Drawing.Size)
Instantiates a new GA drawing with attributes. Loads the specified attribute
file and overrides with the given layout attributes.
AttributeFile: The name of the attribute file to use.
SheetSize: The sheet size of the new GA drawing.

Tekla.Structures.Drawing.GADrawing.Modify
Applies the changes made to the drawing attributes.
Tekla.Structures.Drawing.DrawingHandler
Returns: True on success.

Tekla.Structures.Drawing.GADrawing.Select
Selects the drawing.
Returns: True on success.

Tekla.Structures.Drawing.GADrawing.Insert
Inserts an empty general arrangement drawing. Views must be added separately.
A drawing can be inserted only when there is no active drawing.
Returns: True on success.
Throws Tekla.Structures.Drawing.CannotInsertDrawingException: Thrown if inserting a drawing when another drawing is active.